BEGIN TRANSACTION;
GO

IF EXISTS (SELECT * FROM [sys].[identity_columns] WHERE [name] IN (N'Id', N'SettlementId', N'Name') AND [object_id] = OBJECT_ID(N'[CityDistricts]'))
    SET IDENTITY_INSERT [CityDistricts] ON;
INSERT INTO [CityDistricts] ([Id], [SettlementId], [Name])
VALUES (1, 1, N'Замостянський район'),
(2, 1, N'Ленінський район'),
(3, 1, N'Староміській район'),
(4, 30, N'Амур-Нижньодніпровський район'),
(5, 30, N'Індустріальний район'),
(6, 30, N'Новокодацький район'),
(7, 30, N'Соборний район'),
(8, 30, N'Самарський район'),
(9, 30, N'Центральний район'),
(10, 30, N'Чечелівський район'),
(11, 30, N'Шевченківський район'),
(12, 70, N'Будьонівський район'),
(13, 70, N'Ворошиловський район'),
(14, 70, N'Калінінський район'),
(15, 70, N'Київський район'),
(16, 70, N'Кіровський район'),
(17, 70, N'Куйбишевський район'),
(18, 70, N'Ленінський район'),
(19, 70, N'Петровський район'),
(20, 70, N'Пролетарський район'),
(21, 104, N'Богунський район'),
(22, 104, N'Корольовський район'),
(23, 132, N'Вознесенівський район'),
(24, 132, N'Дніпровський район'),
(25, 132, N'Заводський район'),
(26, 132, N'Комунарський район'),
(27, 132, N'Олександрівський район'),
(28, 132, N'Хортицький район'),
(29, 132, N'Шевченківський район'),
(30, 460, N'Голосiївський район'),
(31, 460, N'Дарницький район'),
(32, 460, N'Деснянський район'),
(33, 460, N'Днiпровський район'),
(34, 460, N'Оболонський район'),
(35, 460, N'Печерський район'),
(36, 460, N'Подiльський район'),
(37, 460, N'Святошинський район'),
(38, 460, N'Солом''янський район'),
(39, 460, N'Шевченківський район'),
(40, 207, N'Артемівський район'),
(41, 207, N'Жовтневий район'),
(42, 207, N'Кам''янобрідський район');
INSERT INTO [CityDistricts] ([Id], [SettlementId], [Name])
VALUES (43, 207, N'Ленінський район'),
(44, 244, N'Галицький район'),
(45, 244, N'Залізничний район'),
(46, 244, N'Личаківський район'),
(47, 244, N'Сихівський район'),
(48, 244, N'Франківський район'),
(49, 244, N'Шевченківський район'),
(50, 278, N'Заводський район'),
(51, 278, N'Інгульський район'),
(52, 278, N'Корабельний район'),
(53, 278, N'Центральний район'),
(54, 292, N'Київський район'),
(55, 292, N'Пересипський район'),
(56, 292, N'Приморський район'),
(57, 292, N'Хаджибейський район'),
(58, 315, N'Київський район'),
(59, 315, N'Подільський район'),
(60, 315, N'Шевченківський район'),
(61, 338, N'Зарічний район'),
(62, 338, N'Ковпаківський район'),
(63, 374, N'Індустріальний район'),
(64, 374, N'Київський район'),
(65, 374, N'Немишлянський район'),
(66, 374, N'Новобаварський район'),
(67, 374, N'Основ''янський район'),
(68, 374, N'Салтівський район'),
(69, 374, N'Слобідський район'),
(70, 374, N'Холодногірський район'),
(71, 374, N'Шевченківський район'),
(72, 386, N'Дніпровський район'),
(73, 386, N'Корабельний район'),
(74, 386, N'Центральний район'),
(75, 414, N'Придніпровський район'),
(76, 414, N'Соснівський район'),
(77, 426, N'Першотравневий район'),
(78, 426, N'Садгірський район'),
(79, 426, N'Шевченківський район'),
(80, 442, N'Деснянський район'),
(81, 442, N'Новозаводський район'),
(82, 461, N'Балаклавський район'),
(83, 461, N'Гагарінський район'),
(84, 461, N'Ленінський район');
INSERT INTO [CityDistricts] ([Id], [SettlementId], [Name])
VALUES (85, 461, N'Нахімовський район');
IF EXISTS (SELECT * FROM [sys].[identity_columns] WHERE [name] IN (N'Id', N'SettlementId', N'Name') AND [object_id] = OBJECT_ID(N'[CityDistricts]'))
    SET IDENTITY_INSERT [CityDistricts] OFF;
GO

INSERT INTO [__EFMigrationsHistory] ([MigrationId], [ProductVersion])
VALUES (N'20231215204618_AddCityDistrictData', N'8.0.0');
GO

COMMIT;
GO

